#include <iostream>
#include "basics.h"

void basics() {
	std::cout << "OOP Basics" << std::endl;
	// Поліморфізм - поєднання до єдиного масиву (колекції)
	// об'єктів різного типу. Формально, об'єкти мають один
	// тип (базового класу), при цьому фактично є об'єктами
	// похідних (дочірніх) типів

	//Product* stock[2];

	//stock[0] = (new Laptop())
	//	->setHardware("Intel Core 5, RAM 16GB, SSD 512GB")
	//	->setPower(90)
	//	->setName("Acer Nitro")
	//	->setPrice(60499);

	//stock[1] = (new Monitor())
	//	->setDiagonal(32)
	//	->setPower(120)
	//	->setName("Dell Vision")
	//	->setPrice(7950);

	//for (auto product : stock) {
	//	std::cout << product->toString() << std::endl;
	//}

	Site* available[2];

	available[0] = (new Flat())
		->setRoom(123)
		->setSquare(456)
		->setLocation("City")
		->setPrice(789)
		->setName("Flat1");

	available[1] = (new Car())
		->setGas("Diesel")
		->setGear("Manual")
		->setYear(2026)
		->setPrice(123123)
		->setName("Car1");

	for (auto site : available) {
		std::cout << site->toString() << std::endl;
	}
}

/*
Основні принципи ООП.
Абстрагування, спадкування, поліморфізм, інкапсуляція.

Абстракція - термін, що означає поєднання деякої множини сутностей.
Приклад - природна мова. Майже будь-яке слово значить множину.
"Телефон" - величезна множина реальних речей (сутностей).
Машинним мовам абстракція не властива, інструкції мають чітке вираження.
Абстрагування - побудова мовних конструкцій, здатних поєднувати
множинні властивості (сутності та інші абстракції).

Створення абстракцій передбачає вивчення (аналіз) предметної області
(чому присвячена програма). Наприклад, крамниця. Виписуємо усі товари,
що мають бути в крамниці, з усіма їх важливими характеристиками.

Ноутбук              Монітор            Миша              Клавіатура
 - назва              - назва            - назва           - назва
 - ціна               - ціна             - ціна            - ціна
 - "залізо"           - діагональ        - DPI             - тип
 - потужність         - потужність       - підключення     - підключення

1) Знаходимо, що є спільного у ВСІХ сутностей: назва та ціна
формуєму вищу абстракію: товар (Product), що поєднує все, що в нас є
						  Product
						  - назва    -- інкапсуляція - переміщення спільних
						  - ціна        властивостей до абстрацій
		  /           /              \                \
Ноутбук              Монітор            Миша              Клавіатура
 - "залізо"           - діагональ        - DPI             - тип
 - потужність         - потужність       - підключення     - підключення

2) Знаходимо групи зі спільними властивостями і будуємо наступний рівень
абстракцій:
 Електротовари (-потужність)     Периферія (-підключення)

						  Product
						- назва - ціна
					  /                \
			Електротовари             Периферія
			- потужність              - підключення
			/         \               /            \
		Ноутбук      Монітор         Миша        Клавіатура
		- "залізо"   - діагональ     - DPI       - тип

повторюємо п.2) для всіх можливих групувань
----------------
Спадкування - механізм реалізації абстрагування - створення класів на
базі інших класів з їх розширенням. Дочірній клас (нащадок) повністю
включає в себе батьківський клас і може додавати власні елементи.
Спадкування може бути каскадним, тобто Електротовари спадкуються від Товару,
а Ноутбук - від Електротовару (а значить і від Товару). Але на відміну
від простого розширення, спадкування зберігає типізацію, тобто
Ноутбук окрім того, що сам є типом, також є типом Електротовар і Товар.

Д.З. Обрати предметну галузь для програмування (взяти з прикладів
популярних сайтів - форуми, оренда житла/автівок тощо)
Виписати основні сутності, провести абстрагування - побудувати
ієрархію класів з абстракціями. Основний результат - діаграма класів.
-----------------
Віртуальні методи
Різниця між віртуальними та невіртуальними методами виникає коли тип
даних посилання на об'єкт та тип самого об'єкта не є однаковими.
(посилання через батьківський тип)
Electrical* stock = new Laptop()
тип посилання (stock) - Electrical*
тип об'єкту - Laptop*
Віртуальні методи викликаються у об'єкта
  stock->v() -- Laptop::v
Невіртуальні методи - за типом даних
  stock->nv() -- Electrical::nv
Невіртуальні методи створюються за замовчанням,
для створення віртуальних необхідно додати оператор "virtual"
*/