#include "data_structures.h"
#include <iostream>

void data_structures() {
	std::cout << "Data structures" << std::endl;
}

/*
Структури даних та шаблонне програмування
1. Структури даних - типові способи організації даних,
   поширені в різних практичних задачах.
-  Стек (Stack) - спосіб за якого дані накопичуються
   в одному порядку, а виводяться в іншому (First In Last Out - FILO)
   3 -> 2 -> 1 -> [Stack]
   [Stack] -> 3 -> 2 -> 1
   Вживається, зокрема, у механізмі виклику функцій
   a(b(c(x))) - 1) c(x), 2) b(res), 3) a(res)
 - Черга (Queue) - 
*/