#include "data_structures.h"
#include "data_structures/linked_list.h"
#include <iostream>

template <typename T>               //  Шаблонними можуть бути функціхх та типи (класи, структури)       
void print(T arg) {                 //  Шаблон вводить "змінну" для типу, традиційно "Т"          
    std::cout << arg << std::endl;  //  В самій функції (чи типі) ця "Т" вживається там,    
}                                   //  де пізніше має бути реальний тип даних.
                                    //  Далі компілятор шукає усі вжитки даного шаблону ...

template<typename T>    // Перед кожним оголошенням повторюється template              
struct fraction {       // Для типів (наприклад структур) шаблон "Т"             
    T numerator;        // може вживатись для оголошення полів 
    T denominator;      // чи методів.      
    void print() {      // Якщо метод не залежит від "Т", то 
        std::cout       // в його тілі не робимо відповідних позначок
            << numerator
            << '/'
            << denominator;
    }
                        // Інші методи можуть мати залежність від "Т"  
    void set_numerator(T n) {
        numerator = n;
    }
}; 

void data_structures() {
    std::cout << "Data structures" << std::endl;
    LinkedList<int>* intList = new LinkedList<int>();
    intList->add(10);
    intList->add(20);
    intList->add(30);
    intList->add(40);
    intList->insertBefore(25, 2);
    intList->print();
}

void data_structures_t() {
	std::cout << "Templates" << std::endl;
    print(1);           // ... і для кожного конкретного вжитку
    print(2);           // створює копію шаблона під даний "Т"
    print("one two");   // Тобто у підсумку буде кілька (4) різні
    print(true);        // функції під кожен тип окремо
    print('A');
    print<short>(22);

    fraction<int> f1{ 1,2 };         // Для різних конкретних типів також
    fraction<float> f2{ 1.5,2.5 };   // буде створено різні структури за     
    fraction<short> f3{ 2,3 };       // єдиннми шаблоном
    f1.print(); std::cout << std::endl;
    f2.print(); std::cout << std::endl;
    f3.print(); std::cout << std::endl;
}

/*
Структури даних та шаблонне програмування
1. Структури даних - типові способи організації даних,
   поширені в різних практичних задачах.
- Стек (Stack) - спосіб за якого дані накопичуються
   в одному порядку, а виводяться в іншому (First In Last Out - FILO)
   3 -> 2 -> 1 -> [Stack]
   [Stack] -> 3 -> 2 -> 1
   Вживається, зокрема, у механізмі виклику функцій
   a(b(c(x))) - 1) c(x), 2) b(res), 3) a(res)
- Черга (Queue) - (First In First Out - FIFO) - прямий
   порядок передачі накопичених даних.
   Може вживатись для буферізації, коли швидкість обробки
   не точно дорівнює швидкості передачи даних
   File -> 1 -> 2 -> 3 -> [Queue] -> 1 -> 2 -> 3 -> [Process]
- Списки (Lists) - колекції з можливістю додавання, вставлення,
   вилучення даних. На відміну від стека та черги, доступ можливий
   до довільного елементу списку. Розрізняють зв'язні списки та
   списки-масиви:
   = зв'язні списки (Linked List) зберігають дані та посилання на інші "вузли"
     списку (або тільки на наступний, або і на наступний і на попередній)
            (Покажчики)
   = списки-масиви (Array List) "тримають" масив із запасом,
     за потреби більшого розширення масив перекопійовується
     у більший масив (Переставляти)
   Порівняння: масиви дозволяють швидко одержати елемент з довільним
    індексом, тоді як зв'язні списки мають "шукати" елементи
    переходячи до сусідних певну кількість разів -- пошук швидший у масивах.
    Недолік масивів полягає в операціях вставки елементів в середину або
    вилучення з середини. В такому разі решта елементів має "посунутись"
    1 2 3 4 5 6 7            1 <-> 2 <-> 3 <-> 4 <-> 5 ....
        ^                                ^
    1 2 - 4 5 6 7            1 <-> 2 <-------> 4 <-> 5 ....
        < - - - -
    1 2 4 5 6 7 _

    ----------------------------------------------------------

    1 2 3 4 5                1 <-> 2 <-> 3 <-> 4 <-> 5
         ^10                                ^10
             - - >        
    1 2 3 10 4 5             1 <-> 2 <-> 3      4 <-> 5
                                          \ 10 /

    Вибір між видами списків робиться з аналізу операцій, що з ними виконуються:
        - якщо список будується один раз, а далі тільки одержуються елементи
         (наприклад, зчитати файл і потім працювати з даними), тоді краще масив
        - якщо список весь час змінюється (наприклад, ігрові елементи - спавняться,
         (збиваються зникають), тоді краще зв'язаний список

    - Множина (Set) - набір з унікальними значеннями (що не повторюються)
        зазвичай в множинах реалізується швидкий пошук завдяки організації
        бінарним деревом. 
    - Бінарне дерево: Структура схожа з зв'язним списком, але має два 
        покажчики - на лівий вузол (з меншим значенням) та правий вузол (з
        більшим значенням)

        Медіана - елемент множини, який ділить її навпіл: як менших, так і більших
        елементів є порівну. Якщо в множини непрна кількість елементів, то
        медіана є середнім елементом. Якщо парна, то середнє від центральних
                              (0 1 2 3 4 5 6 7 8 9 10)
                                         ^
                                         5          
                                  /             \
                            (0 1 2 3 4)     (6 7 8 9 10)
                                 ^               ^
                                         5
                                       /   \
                                      2     8
                                     /\     /\
                                    1  4   6  9                       
                                   /   /    \  \                       
                                  0   3      7  10    


     2^1 = 2
     2^2 = 4
     2^3 = 8
     2^4 = 16
     2^5 = 32
     2^6 = 64
     2^7 = 128
     2^8 = 256
     2^9 = 512
    2^10 = 1024
    2^11 = 2048

    1000 елементів - пошук до 10 разів
    1млн елементів       - до 20 разів
    1млрд                - до 30 разів

- Асоціативні масиви ( Map, Dictionary, Hast-Table) - структури даних,
    в яких індексація може бути не числова. Їх також називають
    "множинами ключ-значення", вживаючии замість терміну "індекс" термін "ключ".
    Вживаються при введенні доменних імен (імен вузлів мережі, які в
    самій мережі адресуються числом)
                                                                         
*/

/*
даних різного типу, то складається враження, що необхідно
створювати декілька однакових за схемою структур, але з різними
типами даних в середині: список для цілих чисел, список для дробовий,
список для рядків тощо.
Узагальнене програмування дозволяє зробити структури даних, що
можуть працювати з різними типами внутрішних даних: описати
Узагальнене (шаблонне) програмування.
Структури даних передбачають організацію даних, але нічого не
зазначають про типи даних. Якщо потрібна органцізація для
шаблон, який буде реалізовуватись для конкретних типів у програмі.
*/