#include "data_structures.h"
#include <iostream>

void data_structures() {
	std::cout << "Data structures" << std::endl;
}

/*
Структури даних та шаблонне програмування
1. Структури даних - типові способи організації даних,
   поширені в різних практичних задачах.
- Стек (Stack) - спосіб за якого дані накопичуються
   в одному порядку, а виводяться в іншому (First In Last Out - FILO)
   3 -> 2 -> 1 -> [Stack]
   [Stack] -> 3 -> 2 -> 1
   Вживається, зокрема, у механізмі виклику функцій
   a(b(c(x))) - 1) c(x), 2) b(res), 3) a(res)
- Черга (Queue) - (First In First Out - FIFO) - прямий
   порядок передачі накопичених даних.
   Може вживатись для буферізації, коли швидкість обробки
   не точно дорівнює швидкості передачи даних
   File -> 1 -> 2 -> 3 -> [Queue] -> 1 -> 2 -> 3 -> [Process]
- Списки (Lists) - колекції з можливістю додавання, вставлення,
   вилучення даних. На відміну від стека та черги, доступ можливий
   до довільного елементу списку. Розрізняють зв'язні списки та
   списки-масиви:
   = зв'язні списки (Linked List) зберігають дані та посилання на інші "вузли"
     списку (або тільки на наступний, або і на наступний і на попередній)
            (Покажчики)
   = списки-масиви (Array List) "тримають" масив із запасом,
     за потреби більшого розширення масив перекопійовується
     у більший масив (Переставляти)
   Порівняння: масиви дозволяють швидко одержати елемент з довільним
    індексом, тоді як зв'язні списки мають "шукати" елементи
    переходячи до сусідних певну кількість разів -- пошук швидший у масивах.
    Недолік масивів полягає в операціях вставки елементів в середину або
    вилучення з середини. В такому разі решта елементів має "посунутись"
    1 2 3 4 5 6 7            1 <-> 2 <-> 3 <-> 4 <-> 5 ....
        ^                                ^
    1 2 - 4 5 6 7            1 <-> 2 <-------> 4 <-> 5 ....
        < - - - -
    1 2 4 5 6 7 _

    ----------------------------------------------------------

    1 2 3 4 5                1 <-> 2 <-> 3 <-> 4 <-> 5
         ^10                                ^10
             - - >        
    1 2 3 10 4 5             1 <-> 2 <-> 3      4 <-> 5
                                          \ 10 /

    Вибір між видами списків робиться з аналізу операцій, що з ними виконуються:
        - якщо список будується один раз, а далі тільки одержуються елементи
         (наприклад, зчитати файл і потім працювати з даними), тоді краще масив
        - якщо список весь час змінюється (наприклад, ігрові елементи - спавняться,
         (збиваються зникають), тоді краще зв'язаний список

    - Множина (Set) - набір з унікальними значеннями (що не повторюються)
        зазвичай в множинах реалізується швидкий пошук завдяки організації
        бінарним деревом. Структура схожа з зв'язним списком, але має два 
        покажчики - на лівий вузол (з меншим значенням) та правий вузол (з
        більшим значенням)

        Медіана - елемент множини, який ділить її навпіл: як менших, так і більших
        елементів є порівну. Якщо в множини непрна кількість елементів, то
        медіана є середнім елементом. Якщо парна, то середнє від центральних
                              (0 1 2 3 4 5 6 7 8 9 10)
                                         ^
                                         5          
                                  /             \
                            (0 1 2 3 4)     (6 7 8 9 10)
                                 ^               ^
                                         5
                                       /   \
                                      2     8
                                     /\     /\
                                    1  4   6  9                       
                                   /   /    \  \                       
                                  0   3      7  10                                 
                                                                         
*/