/*
ООП. Вступ.
Парадигма - термін, що поєднує традиції, прийоми, методики тощо.
У програмувнні існують декілька парадигм:
 - Імперативна парадигма (в яку входить процедурний підхід)
	програма вважається послідовністю інструкцій, серед яких лише одна
	виконується у даний момент часу. Окремі інструкції програми дозволяють
	змінувати порядок виконання (умови, цикли)
	Процедурний підхід - організація коду у вигляді набору процедур, тіла
	яких є послідовностями інструкцій
 - Функціональна парадигма - базується на матиматично-функціональних засадах
	програма вважається "конвертом" у якому лежить інструкція, що слід
	зробити, та новий "конверт" над яким слід виконати цю дію.
	Представники: LISP, Python, J, TCL, Haskel
 - Декаративна парадигма (в яку входить логічна) - базується на теорії знань
	програма складається за набору правил (аксіом) та твредження, яке
	слід перевірити (теореми)
	Представник: Prolog (5 покоління)
 - Об'єктно-орієнтована парадигма (ООП) - базується на принципах взаємодії
	Розроблялась як засіб описання еволюційних систем, у яких задаються
	об'єкти тп правила їх взаємодії. Суть програми - еволюція систем об'єктів.
	З точки зору практичного програмування вносить ідею колекцій - як 
	розвиток поняття масиву, але з можливістю змін розміру (через еволюцію - 
	роботу програми)
	Представники ООП: C#, Java, JavaScript, Python, PHP
*/